In [1]:
import pandas as pd
import numpy as np
import pycountry 
import plotly_express as px
import plotly.graph_objs as go

In [6]:
df_confirmed = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
df_deaths = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')
df_recovered = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')

In [7]:
df_confirmed.columns

Index(['Province/State', 'Country/Region', 'Lat', 'Long', '1/22/20', '1/23/20',
       '1/24/20', '1/25/20', '1/26/20', '1/27/20',
       ...
       '5/15/21', '5/16/21', '5/17/21', '5/18/21', '5/19/21', '5/20/21',
       '5/21/21', '5/22/21', '5/23/21', '5/24/21'],
      dtype='object', length=493)

Converting date columns into a seperate date row using pd.melt func

In [8]:
dates = df_confirmed.columns[4:]

df_confirmed_change1 = df_confirmed.melt(
    id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], 
    value_vars=dates,
    var_name='Date', 
    value_name='Confirmed'
)

In [10]:
df_confirmed_change1[df_confirmed_change1['Country/Region']=='India']

       Province/State Country/Region        Lat      Long     Date  Confirmed
147               NaN          India  20.593684  78.96288  1/22/20          0
422               NaN          India  20.593684  78.96288  1/23/20          0
697               NaN          India  20.593684  78.96288  1/24/20          0
972               NaN          India  20.593684  78.96288  1/25/20          0
1247              NaN          India  20.593684  78.96288  1/26/20          0
...               ...            ...        ...       ...      ...        ...
133247            NaN          India  20.593684  78.96288  5/20/21   26031991
133522            NaN          India  20.593684  78.96288  5/21/21   26289290
133797            NaN          India  20.593684  78.96288  5/22/21   26530132
134072            NaN          India  20.593684  78.96288  5/23/21   26752447
134347            NaN          India  20.593684  78.96288  5/24/21   26948874

[489 rows x 6 columns]

In [48]:
dates = df_confirmed.columns[4:]

df_confirmed_change = df_confirmed.melt(
    id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], 
    var_name='Date', 
    value_name='Confirmed'
)

In [49]:
df_confirmed_change

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
134195,NaN,Vietnam,14.058324,108.277199,5/23/21,5275
134196,NaN,West Bank and Gaza,31.952200,35.233200,5/23/21,305201
134197,NaN,Yemen,15.552727,48.516388,5/23/21,6658
134198,NaN,Zambia,-13.133897,27.849332,5/23/21,93201
134199,NaN,Zimbabwe,-19.015438,29.154857,5/23/21,38682

In [7]:
df_deaths_change = df_deaths.melt(
    id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], 
    value_vars=dates, 
    var_name='Date', 
    value_name='Deaths'
)

In [8]:
df_deaths_change

,Province/State,Country/Region,Lat,Long,Date,Deaths
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
134195,NaN,Vietnam,14.058324,108.277199,5/23/21,43
134196,NaN,West Bank and Gaza,31.952200,35.233200,5/23/21,3459
134197,NaN,Yemen,15.552727,48.516388,5/23/21,1307
134198,NaN,Zambia,-13.133897,27.849332,5/23/21,1268
134199,NaN,Zimbabwe,-19.015438,29.154857,5/23/21,1586

In [9]:
df_recovered_change = df_recovered.melt(
    id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], 
    value_vars=dates, 
    var_name='Date', 
    value_name='Recovered'
)

In [10]:
df_recovered_change

,Province/State,Country/Region,Lat,Long,Date,Recovered
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
126875,NaN,Vietnam,14.058324,108.277199,5/23/21,2721
126876,NaN,West Bank and Gaza,31.952200,35.233200,5/23/21,297201
126877,NaN,Yemen,15.552727,48.516388,5/23/21,3245
126878,NaN,Zambia,-13.133897,27.849332,5/23/21,91156
126879,NaN,Zimbabwe,-19.015438,29.154857,5/23/21,36453

In [11]:
df_recovered_change = df_recovered_change[df_recovered_change['Country/Region']!='Canada']

In [12]:
full_table = df_confirmed_change.merge(
  right=df_deaths_change, 
  how='left',
  on=['Province/State', 'Country/Region', 'Date', 'Lat', 'Long']
)
# Merging full_table and recovered_df_long
full_table = full_table.merge(
  right=df_recovered_change, 
  how='left',
  on=['Province/State', 'Country/Region', 'Date', 'Lat', 'Long']
)

In [13]:
full_table.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
0,NaN,Afghanistan,33.93911,67.709953,1/22/20,0,0,0.0
1,NaN,Albania,41.15330,20.168300,1/22/20,0,0,0.0
2,NaN,Algeria,28.03390,1.659600,1/22/20,0,0,0.0
3,NaN,Andorra,42.50630,1.521800,1/22/20,0,0,0.0
4,NaN,Angola,-11.20270,17.873900,1/22/20,0,0,0.0

### Data Cleaning

In [14]:
full_table['Date'] = pd.to_datetime(full_table['Date'])

In [15]:
full_table.isnull().sum()

Province/State    92232
Country/Region        0
Lat                 976
Long                976
Date                  0
Confirmed             0
Deaths                0
Recovered         10248
dtype: int64

In [16]:
full_table['Recovered'] = full_table['Recovered'].fillna(0)

In [17]:
full_table.isnull().sum()

Province/State    92232
Country/Region        0
Lat                 976
Long                976
Date                  0
Confirmed             0
Deaths                0
Recovered             0
dtype: int64

In [18]:
full_table[full_table['Country/Region']=='MS Zaandam'].head(20)

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
172,NaN,MS Zaandam,0.0,0.0,2020-01-22,0,0,0.0
447,NaN,MS Zaandam,0.0,0.0,2020-01-23,0,0,0.0
722,NaN,MS Zaandam,0.0,0.0,2020-01-24,0,0,0.0
997,NaN,MS Zaandam,0.0,0.0,2020-01-25,0,0,0.0
1272,NaN,MS Zaandam,0.0,0.0,2020-01-26,0,0,0.0
1547,NaN,MS Zaandam,0.0,0.0,2020-01-27,0,0,0.0
1822,NaN,MS Zaandam,0.0,0.0,2020-01-28,0,0,0.0
2097,NaN,MS Zaandam,0.0,0.0,2020-01-29,0,0,0.0
2372,NaN,MS Zaandam,0.0,0.0,2020-01-30,0,0,0.0
2647,NaN,MS Zaandam,0.0,0.0,2020-01-31,0,0,0.0
2922,NaN,MS Zaandam,0.0,0.0,2020-02-01,0,0,0.0
3197,NaN,MS Zaandam,0.0,0.0,2020-02-02,0,0,0.0
3472,NaN,MS Zaandam,0.0,0.0,2020-02-03,0,0,0.0
3747,NaN,MS Zaandam,0.0,0.0,2020-02-04,0,0,0.0
4022,NaN,MS Zaandam,0.0,0.0,2020-02-05,0,0,0.0
4297,NaN,MS Zaandam,0.0,0.0,2020-02-06,0,0,0.0
4572,NaN,MS Zaandam,0.0,0.0,2020-02-07,0,0,0.0
4847,NaN,MS Zaandam,0.0,0.0,2020-02-08,0,0,0.0
5122,NaN,MS Zaandam,0.0,0.0,2020-02-09,0,0,0.0
5397,NaN,MS Zaandam,0.0,0.0,2020-02-10,0,0,0.0

In [19]:
ship_rows = full_table['Province/State'].str.contains('Grand Princess') | full_table['Province/State'].str.contains('Diamond Princess') | full_table['Country/Region'].str.contains('Diamond Princess') | full_table['Country/Region'].str.contains('MS Zaandam')
full_ship = full_table[ship_rows]

In [20]:
full_table = full_table[~(ship_rows)]

In [21]:
full_table

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
0,NaN,Afghanistan,33.939110,67.709953,2020-01-22,0,0,0.0
1,NaN,Albania,41.153300,20.168300,2020-01-22,0,0,0.0
2,NaN,Algeria,28.033900,1.659600,2020-01-22,0,0,0.0
3,NaN,Andorra,42.506300,1.521800,2020-01-22,0,0,0.0
4,NaN,Angola,-11.202700,17.873900,2020-01-22,0,0,0.0
...,...,...,...,...,...,...,...,...
134195,NaN,Vietnam,14.058324,108.277199,2021-05-23,5275,43,2721.0
134196,NaN,West Bank and Gaza,31.952200,35.233200,2021-05-23,305201,3459,297201.0
134197,NaN,Yemen,15.552727,48.516388,2021-05-23,6658,1307,3245.0
134198,NaN,Zambia,-13.133897,27.849332,2021-05-23,93201,1268,91156.0
134199,NaN,Zimbabwe,-19.015438,29.154857,2021-05-23,38682,1586,36453.0

Data Aggregation

In [22]:
#Active cases = Confirmed - Deaths - recovered
full_table['Active'] = full_table['Confirmed'] - full_table['Deaths'] - full_table['Recovered']

In [23]:
full_table[full_table['Active']!= 0]

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,Active
58,Anhui,China,31.825700,117.226400,2020-01-22,1,0,0.0,1.0
59,Beijing,China,40.182400,116.414200,2020-01-22,14,0,0.0,14.0
60,Chongqing,China,30.057200,107.874000,2020-01-22,6,0,0.0,6.0
61,Fujian,China,26.078900,117.987400,2020-01-22,1,0,0.0,1.0
63,Guangdong,China,23.341700,113.424400,2020-01-22,26,0,0.0,26.0
...,...,...,...,...,...,...,...,...,...
134195,NaN,Vietnam,14.058324,108.277199,2021-05-23,5275,43,2721.0,2511.0
134196,NaN,West Bank and Gaza,31.952200,35.233200,2021-05-23,305201,3459,297201.0,4541.0
134197,NaN,Yemen,15.552727,48.516388,2021-05-23,6658,1307,3245.0,2106.0
134198,NaN,Zambia,-13.133897,27.849332,2021-05-23,93201,1268,91156.0,777.0
134199,NaN,Zimbabwe,-19.015438,29.154857,2021-05-23,38682,1586,36453.0,643.0

Aggregate data Country-wise and then group them by date

In [24]:
full_grouped= full_table.groupby(['Date', 'Country/Region'])['Confirmed', 'Deaths', 'Recovered', 'Active'].sum().reset_index()

<ipython-input-24-366f9bd4b8a4>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  full_grouped= full_table.groupby(['Date', 'Country/Region'])['Confirmed', 'Deaths', 'Recovered', 'Active'].sum().reset_index()

In [25]:
full_grouped

            Date      Country/Region  Confirmed  Deaths  Recovered  Active
0     2020-01-22         Afghanistan          0       0        0.0     0.0
1     2020-01-22             Albania          0       0        0.0     0.0
2     2020-01-22             Algeria          0       0        0.0     0.0
3     2020-01-22             Andorra          0       0        0.0     0.0
4     2020-01-22              Angola          0       0        0.0     0.0
...          ...                 ...        ...     ...        ...     ...
92715 2021-05-23             Vietnam       5275      43     2721.0  2511.0
92716 2021-05-23  West Bank and Gaza     305201    3459   297201.0  4541.0
92717 2021-05-23               Yemen       6658    1307     3245.0  2106.0
92718 2021-05-23              Zambia      93201    1268    91156.0   777.0
92719 2021-05-23            Zimbabwe      38682    1586    36453.0   643.0

[92720 rows x 6 columns]

In [26]:
full

NameError: name 'full' is not defined

In [27]:
temp = full_grouped.groupby(['Country/Region','Date', ])['Confirmed', 'Deaths', 'Recovered']
temp = temp.sum().diff().reset_index()

mask = temp['Country/Region'] != temp['Country/Region'].shift(1)
temp.loc[mask, 'Confirmed'] = np.nan
temp.loc[mask, 'Deaths'] = np.nan
temp.loc[mask, 'Recovered'] = np.nan
# renaming columns
temp.columns = ['Country/Region', 'Date', 'New cases', 'New deaths', 'New recovered']
# merging new values
full_grouped = pd.merge(full_grouped, temp, on=['Country/Region','Date'])
# filling na with 0
full_grouped = full_grouped.fillna(0)
# fixing data types
cols = ['New cases', 'New deaths', 'New recovered']
full_grouped[cols] = full_grouped[cols].astype('int')
# 
full_grouped['New cases'] = full_grouped['New cases'].apply(lambda x: 0 if x<0 else x)

<ipython-input-27-18ccc75cebc5>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  temp = full_grouped.groupby(['Country/Region','Date', ])['Confirmed', 'Deaths', 'Recovered']

In [28]:
full_grouped

,Date,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered
0,2020-01-22,Afghanistan,0,0,0.0,0.0,0,0,0
1,2020-01-22,Albania,0,0,0.0,0.0,0,0,0
2,2020-01-22,Algeria,0,0,0.0,0.0,0,0,0
3,2020-01-22,Andorra,0,0,0.0,0.0,0,0,0
4,2020-01-22,Angola,0,0,0.0,0.0,0,0,0
...,...,...,...,...,...,...,...,...,...
92715,2021-05-23,Vietnam,5275,43,2721.0,2511.0,156,1,0
92716,2021-05-23,West Bank and Gaza,305201,3459,297201.0,4541.0,0,0,0
92717,2021-05-23,Yemen,6658,1307,3245.0,2106.0,9,3,44
92718,2021-05-23,Zambia,93201,1268,91156.0,777.0,95,1,54
92719,2021-05-23,Zimbabwe,38682,1586,36453.0,643.0,3,0,8

In [93]:
def get_country_code(name):
    try:
        return pycountry.countries.lookup(name).alpha_3
    except:
        None
full_grouped['iso_code'] = full_grouped['Country/Region'].apply(get_country_code)

In [94]:
full_grouped

,Date,Country/Region,Confirmed,Deaths,Recovered,Active,New cases,New deaths,New recovered,iso_code
0,2020-01-22,Afghanistan,0,0,0.0,0.0,0,0,0,AFG
1,2020-01-22,Albania,0,0,0.0,0.0,0,0,0,ALB
2,2020-01-22,Algeria,0,0,0.0,0.0,0,0,0,DZA
3,2020-01-22,Andorra,0,0,0.0,0.0,0,0,0,AND
4,2020-01-22,Angola,0,0,0.0,0.0,0,0,0,AGO
...,...,...,...,...,...,...,...,...,...,...
92335,2021-05-21,Vietnam,4941,41,2689.0,2211.0,132,2,2,VNM
92336,2021-05-21,West Bank and Gaza,304968,3452,296901.0,4615.0,436,4,1258,None
92337,2021-05-21,Yemen,6632,1302,3179.0,2151.0,19,1,20,YEM
92338,2021-05-21,Zambia,92920,1266,91019.0,635.0,166,1,64,ZMB
92339,2021-05-21,Zimbabwe,38664,1586,36435.0,643.0,29,1,8,ZWE

In [96]:
full_grouped.to_csv('pages/covid.csv')

In [50]:
def fetchdata():
    df_confirmed = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
    df_deaths = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')
    df_recovered = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')

    df_confirmed = df_confirmed.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Confirmed')
    df_deaths = df_deaths.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Deaths')
    df_recovered = df_recovered.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Recovered')

    df_confirmed["Confirmed"] = df_confirmed["Confirmed"].fillna(0)
    df_confirmed.loc[:, "Date"] = df_confirmed["Date"].apply(lambda s: pd.to_datetime(s))


    df_deaths["Deaths"] = df_deaths["Deaths"].fillna(0)
    df_deaths.loc[:, "Date"] = df_deaths["Date"].apply(lambda s: pd.to_datetime(s))

    
    df_recovered["Recovered"] = df_recovered["Recovered"].fillna(0)
    df_recovered.loc[:, "Date"] = df_recovered["Date"].apply(lambda s: pd.to_datetime(s))

    return {
        "Confirmed": df_confirmed.head(),
        "Deaths": df_deaths.head(),
        "Recovered": df_recovered.head()
    }

In [52]:
fetchdata()

{'Confirmed':   Province/State Country/Region       Lat       Long       Date  Confirmed
 0            NaN    Afghanistan  33.93911  67.709953 2020-01-22          0
 1            NaN        Albania  41.15330  20.168300 2020-01-22          0
 2            NaN        Algeria  28.03390   1.659600 2020-01-22          0
 3            NaN        Andorra  42.50630   1.521800 2020-01-22          0
 4            NaN         Angola -11.20270  17.873900 2020-01-22          0,
 'Deaths':   Province/State Country/Region       Lat       Long       Date  Deaths
 0            NaN    Afghanistan  33.93911  67.709953 2020-01-22       0
 1            NaN        Albania  41.15330  20.168300 2020-01-22       0
 2            NaN        Algeria  28.03390   1.659600 2020-01-22       0
 3            NaN        Andorra  42.50630   1.521800 2020-01-22       0
 4            NaN         Angola -11.20270  17.873900 2020-01-22       0,
 'Recovered':   Province/State Country/Region       Lat       Long       Date  Recovered
 0            NaN    Afghanistan  33.93911  67.709953 2020-01-22          0
 1            NaN        Albania  41.15330  20.168300 2020-01-22          0
 2            NaN        Algeria  28.03390   1.659600 2020-01-22          0
 3            NaN        Andorra  42.50630   1.521800 2020-01-22          0
 4            NaN         Angola -11.20270  17.873900 2020-01-22          0}

In [4]:
def fetchdata():
    df_confirmed = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
    df_deaths = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')
    df_recovered = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')

    df_confirmed = df_confirmed.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Confirmed')
    df_deaths = df_deaths.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Deaths')
    df_recovered = df_recovered.melt(id_vars=['Province/State', 'Country/Region', 'Lat', 'Long'], var_name='Date', value_name='Recovered')

    df_all =  df_confirmed.merge(right=df_deaths, how='left',on=['Province/State', 'Country/Region', 'Date', 'Lat', 'Long'])
    df_all = df_all.merge(right=df_recovered, how='left',on=['Province/State', 'Country/Region', 'Date', 'Lat', 'Long'])

    df_all['Confirmed'] = df_all['Confirmed'].fillna(0)
    df_all['Deaths'] = df_all['Deaths'].fillna(0)
    df_all['Recovered'] = df_all['Recovered'].fillna(0)
    df_all['Date'] = df_all['Date'].apply(lambda s: pd.to_datetime(s))

    #tabulating the active cases
    df_all['Active'] = df_all['Confirmed'] - df_all['Deaths'] - df_all['Recovered']

    return df_all.head(10)

In [5]:
fetchdata()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,Active
0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0.0,0.0
1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0.0,0.0
2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0.0,0.0
3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0.0,0.0
4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0.0,0.0
5,NaN,Antigua and Barbuda,17.06080,-61.796400,2020-01-22,0,0,0.0,0.0
6,NaN,Argentina,-38.41610,-63.616700,2020-01-22,0,0,0.0,0.0
7,NaN,Armenia,40.06910,45.038200,2020-01-22,0,0,0.0,0.0
8,Australian Capital Territory,Australia,-35.47350,149.012400,2020-01-22,0,0,0.0,0.0
9,New South Wales,Australia,-33.86880,151.209300,2020-01-22,0,0,0.0,0.0

In [7]:
def load_data():
    """ Function to load data
        param DATA_URL: data_url
        return: pandas dataframe
    """
    data = pd.read_csv(r"data/covid.csv")
    data['Date'] = pd.to_datetime(data['Date']).dt.strftime('%Y-%m-%d')
    return data

df = load_data()
df.head()

,Unnamed: 0,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered,iso_code,Active
0,0,NaN,Afghanistan,33.93911,67.709953,2020-01-22,0,0,0.0,AFG,0.0
1,1,NaN,Albania,41.15330,20.168300,2020-01-22,0,0,0.0,ALB,0.0
2,2,NaN,Algeria,28.03390,1.659600,2020-01-22,0,0,0.0,DZA,0.0
3,3,NaN,Andorra,42.50630,1.521800,2020-01-22,0,0,0.0,AND,0.0
4,4,NaN,Angola,-11.20270,17.873900,2020-01-22,0,0,0.0,AGO,0.0